Revit 2024 API
BeamSystem.DropBeamSystem Method
Drop beam system, it will disassociate all members from the beam system and delete the beam system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static void DropBeamSystem(
	BeamSystem beamSystem
)
Visual Basic
Public Shared Sub DropBeamSystem ( _
	beamSystem As BeamSystem _
)
Visual C++
public:
static void DropBeamSystem(
	BeamSystem^ beamSystem
)
Parameters
beamSystem
Type: Autodesk.Revit.DB.BeamSystem
The beam system to be deleted.
See Also
BeamSystem Class
Autodesk.Revit.DB Namespace